{
	"Addition Schemas": [{
			"Name": "P2W",
			"Equation": "W = PA + PB",
			"Mapping": {
				"W": "Whole",
				"PA": "Part A",
				"PB": "Part B"
			},
			"Comments": "The whole is equal to the sum of two parts."
		},
		{
			"Name": "P3W",
			"Equation": "W = PA + PB + PC",
			"Mapping": {
				"W": "Whole",
				"PA": "Part A",
				"PB": "Part B",
				"PC": "Part C"
			},
			"Comments": "The whole is equal to the sum of three parts."
		},
		{
			"Name": "P4W",
			"Equation": "W = PA + PB + PC + PD",
			"Mapping": {
				"W": "Whole",
				"PA": "Part A",
				"PB": "Part B",
				"PC": "Part C",
				"PD": "PART D"
			},
			"Comments": "The whole is equal to the sum of four parts."
		},
		{
			"Name": "P5W",
			"Equation": "W = PA + PB + PC + PD + PE",
			"Mapping": {
				"W": "Whole",
				"PA": "Part A",
				"PB": "Part B",
				"PC": "Part C",
				"PD": "PART D",
				"PE": "PART E"
			},
			"Comments": "The whole is equal to the sum of five parts."
		},
		{
			"Name": "Tailwind",
			"Equation": "GS = AS + WS",
			"Mapping": {
				"GS": "Ground Speed",
				"WS": "Wind Speed",
				"AS": "Air Speed"
			},
			"Comments": "If a vehicle travels through a moving medium (e.g., airplane in wind; boat on river current), and the vehicle is travelling the same direction as the medium (i.e., with a tailwind for the airplane; downstream for the boat), then slots are: GroundSpeed is the rate of the vehicle relative to land, AirSpeed is the rate of the vehicle relative to the medium, Windspeed is the rate of the medium (i.e., wind’s speed; river current’s speed)."
		},
		{
			"Name": "Headwind",
			"Equation": "GSpeed = AS – WS",
			"Mapping": {
				"GS": "Ground Speed",
				"WS": "Wind Speed",
				"AS": "Air Speed"
			},
			"Comments": "If a vehicle travels through a moving medium (e.g., airplane in wind; boat on river current), and the vehicle is travelling in the opposite direction to the medium (i.e., with a headwind for the airplane; upstream for the boat), then slots are: GroundSpeed is the rate of the vehicle relative to the land, AirSpeed is the rate of the vehicle relative to the medium (i.e., how fast the plane or boat travels in still air or still water), WindSpeed is the rate of the medium (i.e., wind’s speed; river current’s speed)"
		}
	],
	"Multiplication Schemas": [{
			"Name": "DRT",
			"Equation": "D = R * T",
			"Mapping": {
				"D": "Distance",
				"R": "Rate",
				"T": "Time"
			},
			"Comments": "This is used for any problem that talks about a rate per unit of time, such as miles per hour, feet per second, gallons per hour, jobs done per hour, pizzas eaten per minute, etc. The slots are: Rate:  The amount of X per unit of time, Distance:  The amount of X accumulated over the given time, Time:  The amount of time."
		},
		{
			"Name": "Unit Cost",
			"Equation": "T = U * N",
			"Mapping": {
				"T": "Total Cost",
				"U": "Unit Cost",
				"N": "Number of Units"
			},
			"Comments": "If the total cost (or other quantity) of a set of object is mentioned along with the cost per object, then use this.  Used for any problem talking about rate per object, e.g.,  Calories per candy, weight per car, nuts per tree.   The slots are: TotalCost is the total cost of the set of objects, NumberUnits is the number of objects, UnitCost is the cost per object."
		},
		{
			"Name": "Wet solutions",
			"Equation": "I = S * P",
			"Mapping": {
				"I": "Amount of Ingredient",
				"S": "Amount of Solution",
				"P": "Proportion of I to S"
			},
			"Comments": " If a drink is composed of water and alcohol (or any substance is composed of a filler and an active ingredient, e.g., acid in a water solution, fat in sausage), then Amount of Ingredient is the amount of alcohol, measured by weight or volume, Amount of Solution is the total amount of the drink, measured by weight or volume, Proportion of I to S is the proportion (converted from a percentage or proof) of alcohol in the drink."
		},
		{
			"Name": "Map scale",
			"Equation": "D = MS * MD",
			"Mapping": {
				"D": "Distance",
				"MS": "MapScale",
				"MD": "MapDistance"
			},
			"Comments": "If a problem mentions a certain distance in the world corresponds to a certain distance on a map (e.g., 250 miles per inch), then the slots are Distance is the distance in the real world, MapDistance is the distance on the map, MapScale is the map’s scale, when the map’s scale is expressed as “MapScale per Unit” where Unit is the unit used in measuring the distance on the map (e.g., inches, cm).  Thus, if the problem says “250 miles per quarter inch” then we need to convert that to “1000 miles per inch” and then use 1000 as MapScale."
		}
	],
	"Other schemas": [{
			"Name": "Expo Change",
			"Equation": "E = B * (M ^ NM)",
			"Mapping": {
				"E": "End",
				"B": "Beginning",
				"M": "Multiplier",
				"NM": "Number of Multiplications"
			},
			"Comments": "This is used when a starting quantity is multiplied several times by a multiplier.  For example, if John foolishly borrows $500 from a loan shark who charges 25% a month, then the multiplier is 1.25, the starting amount is $500, and the number of multiplications is the number of months.  The slots are: Final is the final amount after all the multiplications have occurred, Start is the amount before all the multiplications have occurred, Multiplier is the factor multiplied over and over, Multiplications is the number of multiplications done."
		},
		{
			"Name": "Avg2",
			"Equation": "A = ( PW + PX )/2",
			"Mapping": {
				"A": "Average",
				"PW": "Part W",
				"PY": "Part Y"
			},
			"Comments": "Average is the Arithmetic Mean of 2 parts"
		},
		{
			"Name": "Avg3",
			"Equation": "A = ( PW + PX + PY )/3",
			"Mapping": {
				"A": "Average",
				"PW": "Part W",
				"PX": "Part X",
				"PY": "Part Y"
			},
			"Comments": "Average is the Arithmetic Mean of 3 parts"
		},
		{
			"Name": "Avg4",
			"Equation": "A = ( PW + PX + PY + PZ )/4",
			"Mapping": {
				"A": "Average",
				"PW": "Part W",
				"PX": "Part X",
				"PY": "Part Y",
				"PZ": "Part Z"
			},
			"Comments": "Average is the Arithmetic Mean of 4 parts"
		}
	]
}
